Repository: lihandafabius/MkulimaAid
Catalog: mkulimaaid/translations/*/LC_MESSAGES/messages.po
Languages: sw

source: Please log in to access MkulimaAid.
sw: Tafadhali ingia ili kufikia MkulimaAid.

source: Language preference updated successfully.
sw: Lugha uliyopendelea imesasishwa kwa mafanikio.

source: Not sure how to recognize diseases affecting your crops? Our tool can help! Just follow these simple steps to get started.
sw: Haujui jinsi ya kutambua magonjwa yanayoathiri mazao yako? Zana yetu inaweza kusaidia! Fuata hatua hizi rahisi kuanza.

source: Step 1: Take a Clear Photo
sw: Hatua ya 1: Piga Picha Safi

source: Capture a close-up, clear image of the affected crop area. Ensure it shows visible symptoms.
sw: Piga picha ya karibu na iliyo wazi ya eneo la zao lililoathirika. Hakikisha inaonyesha dalili zinazoonekana.

source: Step 2: Upload the Image
sw: Hatua ya 2: Pakia Picha

source: Use the upload form below to add your photo. Click on the cloud icon to select your image file.
sw: Tumia fomu ya kupakia hapa chini kuongeza picha yako. Bofya aikoni ya wingu kuchagua faili la picha.

source: Step 3: Analyze
sw: Hatua ya 3: Changanua

source: Sit back and wait for the system to identify possible diseases affecting your crops.
sw: Kaa nyuma na subiri mfumo utambue magonjwa yanayoweza kuathiri mazao yako.

source: Start by uploading a photo below and let MkulimaAid assist you in keeping your crops healthy!
sw: Anza kwa kupakia picha hapa chini na acha MkulimaAid ikusaidie kulinda afya ya mazao yako!

source: Upload an Image for Crop Disease Recognition
sw: Pakia Picha kwa Ajili ya Utambuzi wa Magonjwa ya Mazao

source: Browse File to Upload(click here)
sw: Chagua Faili la Kupakia (bonyeza hapa)

source: Upload
sw: Pakia

source: Analyzing...
sw: Inachanganua...

source: Analyzing the image, please wait...
sw: Inachanganua picha, tafadhali subiri...

source: Uploaded Image:
sw: Picha Iliyopakiwa:

source: Clear Results
sw: Futa Matokeo

source: Trending Crop Diseases
sw: Magonjwa ya Mazao Maarufu kwa Sasa

source: Learn More
sw: Jifunze Zaidi

source: Welcome to MkulimaAid's Crop Disease Recognition!
sw: Karibu kwenye Utambuzi wa Magonjwa ya Mazao wa MkulimaAid!

source: User Settings
sw: Mipangilio ya Mtumiaji

source: Account Settings
sw: Mipangilio ya Akaunti

source: Manage your account details and Language preferences.
sw: Simamia maelezo ya akaunti yako na mapendeleo ya lugha.

source: Manage Account
sw: Simamia Akaunti

source: Security & Privacy
sw: Usalama na Faragha

source: Update your password, two-factor authentication, and privacy settings.
sw: Sasisha nenosiri lako, uthibitisho wa vipengele viwili, na mipangilio ya faragha.

source: Manage Security
sw: Simamia Usalama

source: Notification Settings
sw: Mipangilio ya Arifa

source: Control how you receive notifications and updates.
sw: Dhibiti jinsi unavyopokea arifa na masasisho.

source: Manage Notifications
sw: Simamia Arifa

source: Display Preferences
sw: Mapendeleo ya Onyesho

source: Customize the theme and appearance of the system.
sw: Badilisha mandhari na mwonekano wa mfumo.

source: Customize Display
sw: Badilisha Mwonekano

source: Help & Support
sw: Msaada na Usaidizi

source: Need assistance? Visit our Help Center or contact support.
sw: Unahitaji msaada? Tembelea Kituo chetu cha Msaada au wasiliana na usaidizi.

source: Go to Help Center
sw: Nenda kwenye Kituo cha Msaada

source: Back to Homepage
sw: Rudi kwenye Ukurasa wa Nyumbani
